In [1]:
import numpy as np
import pandas as pd
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

### DataFrame
- 1차원 행렬로 구성된 Series들의 모음
- DataFrame은 데이터 특성(컬럼)만큼의 Series로 구성된다.

### 데이터 프레임 생성
- 2차원 리스트
- 리스트를 가지고 있는 딕셔너리
- 딕셔너리들이 모인 리스트
- 외부 파일(csv, 엑셀, spss 등)
- 클립보드, 데이터베이스, 웹 문서 등등...

In [2]:
# 2차원 리스트를 이용한 생성
# 개수가 다를 경우 부족한 부분은 결측치로 채워진다.
list1 = [
    [1, '남자', np.nan, 80, 70],
    [2, '여자', 91, 81, 71, 61],
    [3, '남자', 92, 82, 72],
    [4, '여자', 93, 83, 73]
]

df1 = pd.DataFrame(list1)

print(df1)
df1

   0   1     2   3   4     5
0  1  남자   NaN  80  70   NaN
1  2  여자  91.0  81  71  61.0
2  3  남자  92.0  82  72   NaN
3  4  여자  93.0  83  73   NaN

   0   1     2   3   4     5
0  1  남자   NaN  80  70   NaN
1  2  여자  91.0  81  71  61.0
2  3  남자  92.0  82  72   NaN
3  4  여자  93.0  83  73   NaN

In [3]:
# index 추출
list(df1.index)

[0, 1, 2, 3]

In [4]:
# column 명 추출
list(df1.columns)

[0, 1, 2, 3, 4, 5]

In [5]:
# 인덱스 설정
df1.index = ['홍길동', '김길동', '박길동', '최길동']
df1

     0   1     2   3   4     5
홍길동  1  남자   NaN  80  70   NaN
김길동  2  여자  91.0  81  71  61.0
박길동  3  남자  92.0  82  72   NaN
최길동  4  여자  93.0  83  73   NaN

In [6]:
# 컬럼명
df1.columns = ['번호', '성별', '국어', '영어', '수학', '한국사']
df1

     번호  성별    국어  영어  수학   한국사
홍길동   1  남자   NaN  80  70   NaN
김길동   2  여자  91.0  81  71  61.0
박길동   3  남자  92.0  82  72   NaN
최길동   4  여자  93.0  83  73   NaN

In [7]:
# 생성시 컬럼명과 인덱스를 지정한다.
list1 = [
    [1, '남자', np.nan, 80, 70],
    [2, '여자', 91, 81, 71, 61],
    [3, '남자', 92, 82, 72],
    [4, '여자', 93, 83, 73]
]

a1 = ['번호', '성별', '국어', '영어', '수학', '한국사']
a2 = ['홍길동', '김길동', '박길동', '최길동']
df1 = pd.DataFrame(list1, columns=a1, index=a2)
df1

     번호  성별    국어  영어  수학   한국사
홍길동   1  남자   NaN  80  70   NaN
김길동   2  여자  91.0  81  71  61.0
박길동   3  남자  92.0  82  72   NaN
최길동   4  여자  93.0  83  73   NaN

In [8]:
# 리스트를 가지고 있는 딕셔너리
# 딕셔너리의 이름이 컬럼 이름으로 지정된다.
# 하나의 리스트가 컬럼 하나가 된다.
# 모든 리스트의 개수가 일치해야지만 생성이 가능하다.
a1 = {
    '번호' : [1, 2, 3, 4],
    '성별' : ['남자', '여자', '남자', '여자'],
    '국어' : [80, 81, 82, 83],
    '영어' : [70, 71, 72, 73],
    '수학' : [60, 61, 62, 73]
}

a2 = ['홍길동', '김길동', '최길동', '박길동']
df1 = pd.DataFrame(a1, index=a2)
df1

     번호  성별  국어  영어  수학
홍길동   1  남자  80  70  60
김길동   2  여자  81  71  61
최길동   3  남자  82  72  62
박길동   4  여자  83  73  73

In [9]:
# 딕셔너리를 가지고 있는 리스트
# 딕셔너리의 이름이 컬럼명으로 결정된다.
# 하나의 딕셔너리는 행으로 구성되며 다른 딕셔너리에 있는 이름이 없으면
# 결측치로 채워진다.

a1 = [
    {'번호' : 1, '성별' : '남자', '국어' : 90, '영어' : 80, '수학' : 70},
    {'번호' : 2, '성별' : '여자', '귝어' : 91, '영어' : 81, '수학' : 71},
    {'번호' : 3, '성별' : '남자', '국어' : 92, '영어' : 82, '수학' : 72},
    {'번호' : 4, '성별' : '여자', '국어' : 93, '영어' : 83, '수학' : 73},
]

a2 = ['홍길동', '김길동', '최길동', '박길동']
df1 = pd.DataFrame(a1, index=a2)
df1

     번호  성별    국어  영어  수학    귝어
홍길동   1  남자  90.0  80  70   NaN
김길동   2  여자   NaN  81  71  91.0
최길동   3  남자  92.0  82  72   NaN
박길동   4  여자  93.0  83  73   NaN